//--------------------------------------------------------------------------------
//
//　ウインドウ表示プログラム
//	Author : Xu Wenjie
//	Date   : 2016-04-26
//--------------------------------------------------------------------------------
//  Update : 
//	
//--------------------------------------------------------------------------------
#include "goal.h"
#include "effect.h"
#include "sound.h"

//--------------------------------------------------------------------------------
//  定数定義
//--------------------------------------------------------------------------------
#define GOAL_RADIUS (28.0f)//ポリゴンの幅
#define GOAL_POS_LEFT_TOP (D3DXVECTOR3(66.0f, 194.0f, 0.0f))//
#define GOAL_POS_CENTER_TOP (D3DXVECTOR3(400.0f, 179.0f, 0.0f))
#define GOAL_POS_RIGHT_TOP (D3DXVECTOR3(735.0f, 193.0f, 0.0f))//
#define GOAL_POS_LEFT_BOTTOM (D3DXVECTOR3(67.0f, 538.0f, 0.0f))//
#define GOAL_POS_CENTER_BOTTOM (D3DXVECTOR3(400.0f, 554.0f, 0.0f))
#define GOAL_POS_RIGHT_BOTTOM (D3DXVECTOR3(734.0f, 537.0f, 0.0f))//
#define NUM_GOAL (6)

//--------------------------------------------------------------------------------
//  構造体定義
//--------------------------------------------------------------------------------

//--------------------------------------------------------------------------------
//  プロトタイプ宣言
//--------------------------------------------------------------------------------

//--------------------------------------------------------------------------------
//  グローバル変数
//--------------------------------------------------------------------------------
D3DXVECTOR3 g_aGoalVec[NUM_GOAL];

//--------------------------------------------------------------------------------
//  初期化処理
//--------------------------------------------------------------------------------
void InitGoal(void)
{
	g_aGoalVec[0] = GOAL_POS_LEFT_TOP;
	g_aGoalVec[1] = GOAL_POS_CENTER_TOP;
	g_aGoalVec[2] = GOAL_POS_RIGHT_TOP;
	g_aGoalVec[3] = GOAL_POS_LEFT_BOTTOM;
	g_aGoalVec[4] = GOAL_POS_CENTER_BOTTOM;
	g_aGoalVec[5] = GOAL_POS_RIGHT_BOTTOM;
}

//--------------------------------------------------------------------------------
//  終了処理
//--------------------------------------------------------------------------------
void UninitGoal(void)
{

}

//--------------------------------------------------------------------------------
//  GOALに辿り着いたかをチェック
//--------------------------------------------------------------------------------
bool CheckGoal(D3DXVECTOR3 vPosCenter)
{
	for (int nCnt = 0;nCnt < NUM_GOAL;nCnt++)
	{
		if (Vector3Magnitude(g_aGoalVec[nCnt] - vPosCenter) <= GOAL_RADIUS)
		{
			SetGoalEffect(vPosCenter);
			PlaySound(SOUND_LABEL_SE_EXPLOSION);
			return false;
		}
	}

	return true;
}